package services;

public class Randomizer {
    public String randomDescriptionNight() {
        String string;
        int random = (int) (Math.random() * 5);
        switch (random) {
            case 0: string = "Місто заснуло, а на вулиці вийшли наркомани та проститутки.";break;
            case 1: string = "Алкаші під вікнами вже зібралися на рейв.";break;
            case 2: string = "Знову хтось вирішив подріфтувати на сусідньому перехресті.";break;
            case 3: string = "Саме час попилососити у сусідів зверху.";break;
            case 4: string = "Всі ще трохи позависають у тік-тоці та підуть спати.";break;
            default: string = "Настав час замислитись над одвічними питаннями замість просто взяти та заснути.";break;
        }
        return string;
    }

    public String randomDescriptionDay() {
        String string;
        int random = (int) (Math.random() * 5);
        switch (random) {
            case 0: string = "Замість офісу довелося іти на міське зібрання."; break;
            case 1: string = "Клятий дощ змусив усіх повертатись за парасольками, але перед цим всі зібрались на " +
                    "обговорення."; break;
            case 2: string = "Всі бабки міста вже їдуть за газетами біля метро, щоб прочитати новини про останні" +
                    " події."; break;
            case 3: string = "Хтось почав свердлити стіни. Це знак, що пора прокидатись."; break;
            case 4: string = "Пора залазити в улюблену маршрутку, щоб доїхати хоч кудись."; break;
            default: string = "Новий день, але все по-старому."; break;
        }
        return string;
    }

    public String getRandomNews() {
        String string;
        int random = (int) ((Math.random() * 24) + 1);
        switch (random) {
            case 1:
                string = "Останнім часом зникає все більше людей. Правоохоронці розводять руками та жаліються на " +
                        "низький рівень фінансування."; break;
            case 2:
                string = "Мешканці однієї з багатоповерхівок спального району жаліються на голосні розборки мафії.";
                break;
            case 3: string = "Екстрасенси з відомого телешоу повідомляють про активізацію темних сил... і залишають " +
                    "візитку. Звертайтесь, якщо потрібна допомога в привороті та знятті проклять."; break;
            case 4: string = "Відомий наркоман одного з мікрорайонів повідомив про зникнення свого уявного " +
                    "друга: шукали всім містом."; break;
            case 5: string = "Мер Мафія-сіті: \"Думаю нам потрібно змінити назву міста.\""; break;
            case 6: string = "В місті запустили перший маршрут громадського транспорту, яким керує робот, а наша " +
                    "служба новин взяла у нього інтерв'ю - штучний інтелект полюбляє шансон і вже навчився " +
                    "чортихатися на неуважних водіїв."; break;
            case 7: string = "На одному з проспектів перекинулась вантажівка з горілчаними виробами - наслідки " +
                    "аварії були оперативно ліквідовані вчасно прибулими на місце ДТП місцевими алкозалежними " +
                    "спеціалістами."; break;
            case 8: string = "Мафіозна служба новин підготувала сюжет про корупцію в міській раді. Дивіться більше " +
                    "в спеціальному випуску програми \"МСН вражає\"."; break;
            case 9: string = "Міський водоканал розпочав планові гідравлічні випробування. Гарячої води не буде " +
                    "3 роки."; break;
            case 10: string = "Темні під'їзди і небувале зростання вторинного ринку лампочок - в ситуації " +
                    "розбиралися наші кореспонденти."; break;
            case 11: string = "Яким бензином заправлятися, 95 чи краденим? Наше видання підготувало для " +
                    "вас ексклюзивний сюжет."; break;
            case 12: string = "Дон мафії комісару Катані: \"Поганець, матір твою, а ну підійди сюди. Ти хотів мене " +
                    "заарештувати? Я тебе сам заарештую, негідник, рукоблуд такий, будь ти проклятий, пане, іди " +
                    "звідси, сволота, негідник, поганець\"."; break;
            case 13: string = "Сенсаційно: як лікарі лікують самі себе. Медпрацівники підроблюють документи, щоб " +
                    "отримувати більші виплати - ексклюзивно на 3+4."; break;
            case 14: string = "Вчора на головній площі міста урочисто відкрили нову гільйотину."; break;
            case 15: string = "\"Краще тебе, ніж мене\" - чому місцеві жителі так обожнюють підставляти один " +
                    "одного? Про це та не тільки читайте на нашому порталі."; break;
            case 16: string = "Влада попереджає, без крайньої необхідності не виходьте у місто вночі."; break;
            case 17: string = "В одному з пологових будинків батьки назвали новонародженого хлопчика Янукович."; break;
            case 18: string = "У місті фіксують неабиякий розгул проституції."; break;
            case 19: string = "\"Тато, мама, я - вся моя сім'я.\" Коли мафіозна \"сім'я\" дійсно має родинні зв'язки. " +
                    "Випуск про сімейний наркобізнес можете переглянути на нашому порталі."; break;
            case 20: string = "Під час зйомок телешоу про судові справи завагітніло три статистки."; break;
            case 21: string = "В одній з поліцейських дільниць із речових доказів зникло півкілограма наркотичних " +
                    "речовин. Чому поліція поїхала шукати їх в сауну та для чого було підкріплення зі жрицями " +
                    "кохання - у нашому сюжеті о 19:00."; break;
            case 22: string = "\"Заборонений плід\", він же яблуко. Охоронці торгового центру пояснили підліткам, " +
                    "чому не можна красти айфони."; break;
            case 23: string = "Гроші, карти, два коня. Гостросюжетний бойовик у центрі міста: цигани вирішили " +
                    "позмагатися між собою - золоті зуби збирали до самого вечора."; break;
            case 24: string = "Секрет стрімкого успіху, або як майстер по \"ноготочкам\" виявилася наркодилером. Для " +
                    "перегляду статті повністю оформлюйте річну підписку."; break;
            default:
                string = "Департамент поліції повідомив, що рівень злочинності в місті зріс на 300 відсотків.";
                break;
        }
        return string;
    }

    public String getRandomExecution(String name) {
        String string;
        int random = (int) (Math.random() * 5);
        switch (random) {
            case 0: string = name + " втілює приказку \"Побачити Мафія-сіті та померти\" в життя. Буквально."; break;
            case 1: string = name + " стає випробувачем нашої нової гільйотини."; break;
            case 2: string = name + " стає головним учасником четвертування."; break;
            case 3: string = name + " - найкращий кандидат на повішення."; break;
            case 4: string = name + " отримує статус мільйонного страченого, в подарунок - святковий ешафот."; break;
            default: string = name + " тепер висить на стінах міста."; break;
        }
        return string;
    }
}
